# Lab | Data Aggregation and Filtering

In this challenge, we will continue to work with customer data from an insurance company. We will use the dataset called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by first performing data cleaning, formatting, and structuring.

1. Create a new DataFrame that only includes customers who have a total_claim_amount greater than $1,000 and have a response of "Yes" to the last marketing campaign.

In [3]:
import pandas as pd

url = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis.csv"
df = pd.read_csv(url)

In [4]:
df_1 = df.dropna()

In [5]:
df_1.columns = [col.lower() for col in df_1.columns]

In [6]:
df_1.columns = [col.replace(" ", "_") for col in df_1.columns]

In [7]:
df_1["response"].value_counts()

response
No     3902
Yes     641
Name: count, dtype: int64

In [8]:
df_1.head(3)

,unnamed:_0,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,...,number_of_open_complaints,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type
2,2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2/10/11,Employed,M,...,0.0,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,1/11/11,Employed,M,...,0.0,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A
10,10,HG93801,Arizona,5154.764074,No,Extended,High School or Below,1/2/11,Employed,M,...,0.0,1,Corporate Auto,Corporate L3,Offer2,Branch,442.521087,SUV,Large,A

In [9]:
new_df = df_1[df_1["total_claim_amount"] > 1000].groupby("total_claim_amount").agg({"response": lambda x: (x == "Yes")}).reset_index()
new_df

     total_claim_amount                  response
0           1003.050834                     False
1           1003.160633                     False
2           1003.200000                     False
3           1004.755092                     False
4           1008.000000  [True, True, True, True]
..                  ...                       ...
171         2270.508697                     False
172         2294.631639                     False
173         2345.413441                     False
174         2759.794354                     False
175         2893.239678                     False

[176 rows x 2 columns]

In [10]:
df_1.head(3)

,unnamed:_0,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,...,number_of_open_complaints,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type
2,2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2/10/11,Employed,M,...,0.0,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,1/11/11,Employed,M,...,0.0,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A
10,10,HG93801,Arizona,5154.764074,No,Extended,High School or Below,1/2/11,Employed,M,...,0.0,1,Corporate Auto,Corporate L3,Offer2,Branch,442.521087,SUV,Large,A

In [ ]:
# 2. Using the original Dataframe, analyze the average total_claim_amount by each policy type and gender for customers who have responded "Yes" to the last marketing campaign. Write your conclusions.

In [16]:
yes_df=df_1[df_1['response'] == 'Yes']
group_df = yes_df.groupby(['policy_type', 'gender'])
average_df = group_df['total_claim_amount'].mean()
average_df
#the average total claim amount has the highest value for woman with corporate auto and the lowest for men with special auto

policy_type     gender
Corporate Auto  F         404.104008
                M         391.370774
Personal Auto   F         457.056315
                M         472.489180
Special Auto    F         495.689401
                M         368.523035
Name: total_claim_amount, dtype: float64

3. Analyze the total number of customers who have policies in each state, and then filter the results to only include states where there are more than 500 customers.

In [17]:
df_1.head(1)

,unnamed:_0,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,...,number_of_open_complaints,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type
2,2,LZ68649,Washington,14947.9173,No,Basic,Bachelor,2/10/11,Employed,M,...,0.0,2,Personal Auto,Personal L3,Offer3,Call Center,480.0,SUV,Medsize,A

In [26]:
df_2 = df_1.groupby("state").agg({"customer":"count"})
df_3 = df_2[df_2 > 500]
df_3

            customer
state
Arizona        868.0
California    1552.0
Nevada           NaN
Oregon        1281.0
Washington       NaN

4. Find the maximum, minimum, and median customer lifetime value by education level and gender. Write your conclusions.

In [27]:
df_1.head(1)

,unnamed:_0,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,...,number_of_open_complaints,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type
2,2,LZ68649,Washington,14947.9173,No,Basic,Bachelor,2/10/11,Employed,M,...,0.0,2,Personal Auto,Personal L3,Offer3,Call Center,480.0,SUV,Medsize,A

In [39]:
df_1.groupby(['education', 'gender'])['customer_lifetime_value'].min()
#the highest min value is for doctor female and the lowest is for female bachelor

education             gender
Bachelor              F         1904.000852
                      M         2030.783687
College               F         2004.350666
                      M         1918.119700
Doctor                F         2395.570000
                      M         2267.604038
High School or Below  F         2150.178588
                      M         2132.771675
Master                F         2417.777032
                      M         2357.503128
Name: customer_lifetime_value, dtype: float64

In [42]:
df_1.groupby(['education', 'gender'])['customer_lifetime_value'].describe()

                             count         mean          std          min  \
education            gender
Bachelor             F       720.0  8039.291389  6703.831267  1904.000852
                     M       654.0  8125.264831  7289.224369  2030.783687
College              F       686.0  7798.083814  7009.400072  2004.350666
                     M       655.0  7984.296245  6557.419953  1918.119700
Doctor               F        85.0  8475.302851  7753.067122  2395.570000
                     M        86.0  7659.742101  5519.648301  2267.604038
High School or Below F       642.0  8475.522665  7399.947872  2150.178588
                     M       645.0  7730.151093  6746.871852  2132.771675
Master               F       193.0  8243.128850  6969.095574  2417.777032
                     M       177.0  8013.870033  7369.927884  2357.503128

                                     25%          50%          75%  \
education            gender
Bachelor             F       4190.607405  5752.485185  8801.458274
                     M       3987.306526  5797.377350  8934.680548
College              F       4044.985596  5642.596077  8713.522074
                     M       4028.100240  6005.847375  9078.500729
Doctor               F       3975.321516  5789.850900  9928.986032
                     M       3989.729600  5843.989737  8964.009730
High School or Below F       4020.574761  5978.754765  9201.547026
                     M       4101.935985  6081.481291  8819.018934
Master               F       4170.687348  5714.165863  9031.214859
                     M       3585.942995  5512.342258  8849.689719

                                     max
education            gender
Bachelor             F       58753.88046
                     M       67907.27050
College              F       61850.18803
                     M       44795.46942
Doctor               F       44856.11397
                     M       32677.34284
High School or Below F       55277.44589
                     M       83325.38119
Master               F       51016.06704
                     M       50568.25912

In [37]:
df_1.groupby(['education', 'gender'])['customer_lifetime_value'].max()
##the highest max value is for bachelor male and the lowest is for doctor male

education             gender
Bachelor              F         58753.88046
                      M         67907.27050
College               F         61850.18803
                      M         44795.46942
Doctor                F         44856.11397
                      M         32677.34284
High School or Below  F         55277.44589
                      M         83325.38119
Master                F         51016.06704
                      M         50568.25912
Name: customer_lifetime_value, dtype: float64

In [ ]:
#

## Bonus

5. The marketing team wants to analyze the number of policies sold by state and month. Present the data in a table where the months are arranged as columns and the states are arranged as rows.

6.  Display a new DataFrame that contains the number of policies sold by month, by state, for the top 3 states with the highest number of policies sold.

*Hint:*
- *To accomplish this, you will first need to group the data by state and month, then count the number of policies sold for each group. Afterwards, you will need to sort the data by the count of policies sold in descending order.*
- *Next, you will select the top 3 states with the highest number of policies sold.*
- *Finally, you will create a new DataFrame that contains the number of policies sold by month for each of the top 3 states.*

7. The marketing team wants to analyze the effect of different marketing channels on the customer response rate.

Hint: You can use melt to unpivot the data and create a table that shows the customer response rate (those who responded "Yes") by marketing channel.

External Resources for Data Filtering: https://towardsdatascience.com/filtering-data-frames-in-pandas-b570b1f834b9

In [ ]:
# your code goes here